# StructuralAttachmentBaseReferencedend Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAttachmentBaseReferencedend Property
ParameterTypeId Class See Also
---
"Base Attachment Referenced End"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAttachmentBaseReferencedend { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAttachmentBaseReferencedend As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAttachmentBaseReferencedend {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace